{
  "events": [
    {
      "id": 1,
      "title": "A Home-Cooked Meal", 
      "image": "events-cooking.jpg",
      "date": "Saturday, Dec 14th",
      "timeStartEnd": "6:00 PM - 9:00 PM",
      "description": "Join Chef Joshua for an intimate dining experience in his Brooklyn brownstone. He'll prepare a seasonal four-course meal using fresh, local ingredients while sharing stories and techniques from his years in professional kitchens.\n\nThe evening will include wine pairings selected to complement each course, and guests will leave with recipe cards to recreate their favorite dishes at home.",
      "location": "Private residence, Brooklyn, NY",
      "openSpots": "5/10 spots left", 
      "hostName": "Joshua",
      "hostAvatar": "avatar-chef.png"
    },
    {
      "id": 2,
      "title": "Tai Chi with Master Chen",
      "image": "events-taichi.png",
      "date": "Tuesday, March 11th",
      "timeStartEnd": "5:00 PM - 6:30 PM",
      "description": "Experience the ancient art of Tai Chi in the serene setting of Prospect Park. Master Chen guides participants through gentle movements and breathing exercises, helping reduce stress and improve balance.\n\nPerfect for beginners and experienced practitioners alike. After the session, join us for complimentary herbal tea and learn about the philosophy behind Tai Chi, its health benefits, and how to incorporate its principles into your daily life.",
      "location": "Prospect Park, Brooklyn, NY",
      "openSpots": "6/25 spots left",
      "hostName": "Chen",
      "hostAvatar": "avatar-taichi.png"
    },
    {
      "id": 3,
      "title": "7th Ave Community Garden Grand Opening",
      "image": "events-garden.jpg",
      "date": "Sunday, April 20th",
      "timeStartEnd": "10:00 AM - 5:00 PM",
      "description": "Join us for the grand opening of our community garden! Tour the new plots, meet fellow gardeners, and learn about sustainable urban farming. Light refreshments will be served, and visitors can sign up for garden plots and upcoming workshops.\n\nThis community garden project has been in development for over a year, transforming an unused lot into a vibrant green space. The garden features 50 individual plots, a shared herb garden, composting station, and rain water collection system. We'll also be announcing our schedule of free gardening classes, seed exchanges, and seasonal harvest celebrations.",
      "location": "7th Ave Community Garden, Bushwick",
      "openSpots": "12/50 spots left",
      "hostName": "Annie",
      "hostAvatar": "avatar-gardener.png"
    }
  ]
}